gu3 <- read.csv("gu_data_3.csv")

## 정규성 검정을 하기 전 histogram

par(mfrow=c(1,2))
hist(gu3$평당가격, breaks = 10, col = 2)
hist(gu3$범죄발생수, breaks = 10, col = 2)
hist(gu3$보건기관수, breaks = 10, col = 2)
hist(gu3$국립공원수, breaks = 10, col = 2)
hist(gu3$유흥업소수, breaks = 10, col = 2)
hist(gu3$교육기관수, breaks = 10, col = 2)
hist(gu3$해당.지역.지하철.지점수, breaks = 10, col = 2)
hist(gu3$합계_자가용, breaks = 10, col = 2)
hist(gu3$보유도서합계, breaks = 10, col = 2)
hist(gu3$도서관.방문자수, breaks = 10, col = 2)
hist(gu3$은행합계, breaks = 10, col = 2)
hist(gu3$미세먼지평균, breaks = 10, col = 2)

#@ 정규성 검정
shapiro.test(gu3$평당가격) #0.06203
shapiro.test(gu3$범죄발생수) #0.42
shapiro.test(gu3$보건기관수) #0.01925
shapiro.test(gu3$국립공원수) #0.06042
shapiro.test(gu3$유흥업소수) #0.0009866
shapiro.test(gu3$교육기관수) #0.1276
shapiro.test(gu3$해당.지역.지하철.지점수) #0.134
shapiro.test(gu3$보유도서합계) #0.1857
shapiro.test(gu3$합계_자가용) #0.1333
shapiro.test(gu3$도서관.방문자수) #0.08765
shapiro.test(gu3$은행합계) #1.282e-05
shapiro.test(gu3$미세먼지평균) #0.564
shapiro.test(gu3$여권발급합계) #0.002425


par(mfrow =c(2,2))
plot(gu3)

# 공분산 구하기

attach(gu3)

cov(평당가격,국립공원수) # 음수니까 두 변수 간의 상관관계는 하강하는 경향이라고 이해할 수 있다. 다만 표준화가 안 되었기 때문에 수치만으로 얼마나 크게 변화하는지는 알 수 없다.
cov(평당가격,해당.지역.지하철.지점수) # 음수니까 두 변수 간의 상관관계는 하강하는 경향이라고 이해할 수 있다. 다만 표준화가 안 되었기 때문에 수치만으로 얼마나 크게 변화하는지는 알 수 없다.
cov(평당가격,`범죄발생수`) # 음수니까 두 변수 간의 상관관계는 하강하는 경향이라고 이해할 수 있다. 다만 표준화가 안 되었기 때문에 수치만으로 얼마나 크게 변화하는지는 알 수 없다.
cov(평당가격,교육기관수) # 음수니까 두 변수 간의 상관관계는 하강하는 경향이라고 이해할 수 있다. 다만 표준화가 안 되었기 때문에 수치만으로 얼마나 크게 변화하는지는 알 수 없다.
cov(평당가격,유흥업소수) # 음수니까 두 변수 간의 상관관계는 하강하는 경향이라고 이해할 수 있다. 다만 표준화가 안 되었기 때문에 수치만으로 얼마나 크게 변화하는지는 알 수 없다.
cov(평당가격,보건기관수) # 음수니까 두 변수 간의 상관관계는 하강하는 경향이라고 이해할 수 있다. 다만 표준화가 안 되었기 때문에 수치만으로 얼마나 크게 변화하는지는 알 수 없다.
cov(평당가격,합계_자가용) # 음수니까 두 변수 간의 상관관계는 하강하는 경향이라고 이해할 수 있다. 다만 표준화가 안 되었기 때문에 수치만으로 얼마나 크게 변화하는지는 알 수 없다.
cov(평당가격,보유도서합계) # 음수니까 두 변수 간의 상관관계는 하강하는 경향이라고 이해할 수 있다. 다만 표준화가 안 되었기 때문에 수치만으로 얼마나 크게 변화하는지는 알 수 없다.
cov(평당가격,`도서관.방문자수`) # 음수니까 두 변수 간의 상관관계는 하강하는 경향이라고 이해할 수 있다. 다만 표준화가 안 되었기 때문에 수치만으로 얼마나 크게 변화하는지는 알 수 없다.
cov(평당가격,여권발급합계) # 음수니까 두 변수 간의 상관관계는 하강하는 경향이라고 이해할 수 있다. 다만 표준화가 안 되었기 때문에 수치만으로 얼마나 크게 변화하는지는 알 수 없다.
cov(평당가격,은행합계) # 음수니까 두 변수 간의 상관관계는 하강하는 경향이라고 이해할 수 있다. 다만 표준화가 안 되었기 때문에 수치만으로 얼마나 크게 변화하는지는 알 수 없다.
cov(평당가격,미세먼지평균) # 음수니까 두 변수 간의 상관관계는 하강하는 경향이라고 이해할 수 있다. 다만 표준화가 안 되었기 때문에 수치만으로 얼마나 크게 변화하는지는 알 수 없다.

detach(gu)

### 연구가설 1 - 피어슨 상관계수
#1-1) 보건기관수와 평당가격 간에는 관계가 있을 것이다.
#1-2) 유흥업소수와 평당가격 간에는 관계가 있을 것이다.
#1-3) 은행합계와 평당가격 간에는 관계가 있을 것이다.

### 연구가설 2 - 스피어만 상관계수
#2-1) 범죄발생수와 평당가격 간에는 관계가 있을 것이다.
#2-2) 교육기관수와 평당가격 간에는 관계가 있을 것이다.
#2-3) 해당.지역.지하철.지점수와 평당가격 간에는 관계가 있을 것이다.
##2-4) 도서관 방문자수와 평당가격 간에는 관계가 있을 것이다.
#2-5) 여권발급합계와 평당가격 간에는 관계가 있을 것이다.
#2-6) 미세먼지평균과 평당가격 간에는 관계가 있을 것이다.
#2-7) 보유도서합계와 평당가격 간에는 관계가 있을 것이다.

library(ggplot2)
library(corrplot)


cor.var <- gu3[c("보건기관수","유흥업소수", "은행합계")]
round(cor(cor.var, use = "pairwise.complete.obs"),4) # 소숫점 4자리수까지 조정을 하고 cor함수를 사용하였다


# 상관계수를 파악하기 전, 산점도로 변수간의 관련성을 그림으로 시각화
plot(cor.var, cex = 1, pch = 1, col = "blue") #그래프로 분포 확인 #지역별로 같은 값을 나타내는 경우가 많이 이와 같은 형태의 그래프를 볼 수 있다.

# 상관관계 (상관계수는 표준화된 공분산)
cor.test(gu3$평당가격,gu3$`보건기관수`)
cor.test(gu3$평당가격,gu3$`유흥업소수`)
cor.test(gu3$평당가격,gu3$`은행합계`)

library(sjPlot)
tab_corr(cor.var,var.labels = c("보건기관수","유흥업소수","은행합계"),corr.method = "pearson", na.deletion = "pairwise", p.numeric = T, encoding = "EUC-KR")

library(psych)
str(gu3)
cor.var2 <- gu3[c("평당가격","범죄발생수","교육기관수", "해당.지역.지하철.지점수","도서관.방문자수","여권발급합계","미세먼지평균","보유도서합계")]
cor2 <- cor(cor.var2,method = 'spearman')

# 상관계수와 p-value 
# |                       |          |         |
# |-----------------------|----------|---------|
# | 두 변수               | 상관계수 | p-value |
# | 평당가격-보건기관수 | -0.0488     | 0.8219    |
# | 평당가격-유흥업소수 | -2767515     | 0.1905    |
# | 평당가격-은행합계 | -0.3630     | 0.0812    |

  #p-value가 전부 0.05보다 크기에 상관관계가 없다는 것이 나왔다
  
# 상관계수  
# | 평당가격-범죄발생수   | -0.3765217    | 
## | 평당가격-교육기관수   | 0.2744075     | 
# | 평당가격-해당.지역.지하철.지점수 |  0.1843142     | 
# | 평당가격-도서관.방문자수 | -0.12260870     | 
# | 평당가격-여권발급합계 | -0.4078261     | 
# | 평당가격-미세먼지평균 | -0.12260870     | 
# | 평당가격-보유도서합계 | 0.06173913     |

#상관계수는 절대값이 1에 가까울 수록 상관관계가 있는 것이다
  
