apt <- read.csv("apt_final_1.csv")
str(apt)
colnames(apt)[c(3,4,5,6,17)] <- c("건축 연도"," 최근 매매 연도","아파트 이름","최근 매매 월","해당 지역 지하철 지점수")
colnames(apt)
# 상관 분석
- 상관계수를 파악하기 전, 산점도로 변수간의 관련성을 그림으로 시각화
#install.packages("ggplot2")
library(ggplot2)
attach(apt)

plot(평당가격~`층수`, main = "평당 가격과 국립 공원 수 사이의 산점도", xlab = "국립 공원 수", ylab = "평당 가격 ", cex = 1, pch = 1, col = "blue")
plot(평당가격~`국립공원수`)
cov(평당가격,층수) # 양수니까 두 변수 간의 상관관계는 상승하는 경향이라고 이해할 수 있다.
cor(평당가격,층수, use = 'complete.obs', method = 'pearson') # 상관계수는 -1에서 1 사이의 수를 가지는데 0이면 선형관계가 없는 것이다. 0.13으로 선형관계가 보이지 않는 것을 확인할 수 있다.
cov(평당가격,국립공원수) # 음수니까 두 변수 간의 상관관계는 하강하는 경향이라고 이해할 수 있다.
cor(평당가격,국립공원수, use = 'complete.obs', method = 'pearson') # 이 또한 선형관계가 없음을 확인할 수 있다.

detach(apt)
#install.packages("corrplot")
library(corrplot)
cor.var <- apt[c("평당가격", "해당 지역 지하철 지점수","국립공원수")]
round(cor(cor.var, use = "pairwise.complete.obs"),2) # 소숫점 2자리수까지 조정을 하고 cor함수를 사용하였다

plot(cor.var) #그래프로 확인 #지역별로 같은 값을 나타내는 경우가 많이 이와 같은 형태의 그래프를 볼 수 있다.

cor.test(apt$평당가격,apt$`해당 지역 지하철 지점수`) # 평당가격과 해당 지역 지하철 지점수라는 두 변수 간 상관 관계의 유의도 출력
- 상관계수는 0.005769014이고 유의도는 0.1706으로 0.05보다 높게 나타난다.
- -> 평당가격과 해당 지역 지하철 지점수와 관계가 있을 것이라는 연구가설이 기각되고, 평당가격과 지하철 지점수 간에 관계가 없을 것이라는 영가설이 채택된다.

cor.test(apt$평당가격,apt$`국립공원수`) # 평당가격과 국립공원수라는 두 변수 간 상관 관계의 유의도 출력
- 상관계수는 -0.0003684291이고 유의도는 0.9303으로 0.05보다 높게 나타난다.

- 상관 분석을 한 결과 평당가격과 해당 지역 지하철 지점수, 국립공원의 수는 상관 관계가 없다는 것을 알 수 있다.
